// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
Console.Write("Input first number: ");
int numA = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number: ");
int numB = Convert.ToInt32(Console.ReadLine());
if (numA > numB)
{
    Console.Write("First number is more, and second number is less  ");
}
else 
    Console.Write("Second number is more, and first number is less   ");
    
  